[
    "@SmasH_Buster #SmasH_Buster\n\nПоскольку плотный график работы и учебы не давал засесть за материал должным образом, окончил я свое обучение с Никитой спустя 5 месяцев, но получил отличный результат: спидран из 5 собеседований - 3 оффера, из которых два в крупный банк. Все офферы были на 300к+.\nЛично от себя хочу сказать, огромное тебе спасибо и выразить невероятный respect. Всем, кто ищет реально труъ ментора смело можете обращаться к Никите. Моя оценка 13/10 -  ведьмак от мира менторинга)\n\nАвтор: @vduke\n",
    "@SmasH_Buster #SmasH_Buster\n\nНикита сам продумал легенду, заполнил cv, отвечал на все вопросы и по легенде и по теории, устроил 2 мок-интервью, поддерживал морально, почти держал меня за руку на моем 1 скрининге и торговался как черт за оффер.  В первые дни на работе подсказывал как правильно задать тот или иной вопрос.\nИтог: 2 недели на подготовку и 3 недели после открытия cv и оффер 280к, боюсь собесов намного меньше. Моя оценка 10/10\n\nАвтор: @Vladimir0feshenko\n",
    "@SmasH_Buster #SmasH_Buster\n\nЯ вышел на рынок в конце 2023 года, прошел около 12 интервью,первые 5 были провальные (что норма),а  потом пошло как по маслу. В итоге получил оффер на мидла 220к (реального опыта 0) и сейчас буду проходить испытательный срок.\nВзаимодействие с Никитой на этом не прекратилось, так как я могу обращаться к нему за помощью по рабочим таскам.\nСмело рекомендую работу с данным ментором!\n\nАвтор: @dotnet_runner\n",
    "@SmasH_Buster #SmasH_Buster Никита Перевалов.\n\nПришла к Никите перед стажировкой в стартаповой команде. Было очень тяжело и меня закинули на котлин, плюс стек новый кроме спринга и довольно требовательный лид. Никита помог вкатиться и выдержать начало, по описаниям проблемы тренировал на навыки и конструкции кода, чтобы не нарушить нда. Я выжила на стажировке, оставили в крупной компании без накруток опыта и вранья. Спасибо Никите за моральную поддержку частые созвоны, скилы и помощь в адаптации!\n\nАвтор: @korvalanni\n",
    "@SmasH_Buster #SmasH_Buster Никита Перевалов.\n\nНе понимал в какую сторону двигаться, какой текущий уровень знаний, и на какую зп могу претендовать. \nНикита провел мок собес, указал на узкие места, сориентировал по зарплатным ожиданиям, помог с легендой, а самое главное-дал уверенности для дальнейших действий)\n\nАвтор: @apereslavtsev\n",
    "@SmasH_Buster #SmasH_Buster Nikita Perevalov\n\nПроходил у @SmasH_Buster МОК собес за 5к рублей. Хотел оценить свои навыки перед выходом на рынок. Собес длился 2 часа, была как теоретическая часть, вопросы по резюме и опыту работы, так и решение задачи. В итоге Никита дал развернутую обратную связь, подсветил сильные и слабые стороны, ответил на все мои вопросы, дал конкретные ссылки и темы где прокачаться. Рекомендую.\n\nАвтор: @baterok\n",
    "@SmasH_Buster #SmasH_Buster\n\nПосле сложных для меня интервью мы с Никитой обсуждали и моделировали ситуации, в которых я возможно неправильно себя повел, делали выводы и я двигался к следующему собесу гораздо увереннее. Никита проявил максимальное участие, был всегда на связи (и до сих пор остается).\nКак итог - 3 собеса в день и еще куча отменных лично мной, 4 вкусных оффера и трудоустройство в конце ноября на условиях, которые оказались значительно выше моих ожиданий.\n\nАвтор: @gtyene\n",
    "#SmasH_Buster @SmasH_Buster\n\nНа протяжении всего обучения, я задавал Никите много вопросов, как практических, так и теоретических. На сессиях он мне очень подробно и наглядно объяснял, если я чего-то не понимал. В процессе поиска всегда помогал, спрашивал как прошло и мы разбирали ошибки, которые я допускал на собесах. \nПо итогу я очень доволен обучением, так как я осуществил поставленную цель - устроиться на новую работу с 2х зп. Ну, и помимо этого, мои контакты пополнились грамотным специалистом, к которому я и сейчас всегда могу обратиться с вопросами. \nОчень советую этого ментора!\n\n\nАвтор: @alextale1\n",
    "@SmasH_Buster #SmasH_Buster\n\nРезюмируя: запрос на подготовку, 2-3 месяца плотной работы, и как итог долгожданный оффер в крупную компанию с очень приятной ЗП. Ментор хороший и конкурсы интересные. \nP.S На протяжении всего общения и подготовки днем и ночью в личку задавал очень много разных вопросов, от технических до софтовых, на что оперативно получал ответы. До сих пор продолжаем общаться с Никитой, и думаю что без проблем пройду с его поддержкой испытательный срок. \nP.S.S. Результат зависит от вас самих. Какого бы первоклассного ментора вам не дали если нет стремления и время на обучения ничего не получится. А Никита со своими задачи справляется, рекомендую! Если есть какие-то вопросы по обучению, вы смело можете мне написать и я расскажу о том что вас интересует, дерзайте!\n\nАвтор: @dd8840\n"
]