[
    "@SmasH_Buster #SmasH_Buster\n\nСначала немного обо мне, я с РБ, опыта 0, учил Java года 2 параллельно проходил разные курсы и стажировки от компаний, но каждый раз меня не брали на работу. После очередного отказа нашел галеру, где даже резюме мне сказали себе придумать самому чтобы потом они меня продали))0))).\nИ пока я искал как правильно рисовать опыт наткнулся на каналы Кошачья бацыла и Антона Назарова посмотрев пару видосов подумал, а зачем отдавать галере деньги если я все делаю сам  и не проще ли заплатить 1-2 раза за помощь ментору и жить себе спокойно.  Долго сомневался, выбирал ментора и таки решил рискнуть.\nНа 1 занятии Никита оценил мой уровень высоко и сказал, что я достаточно умен чтобы выходить на рынок и он не может взять с меня столько денег. Мы договорились только о 1 взносе и добровольном донате после нахождения работы.\nНикита сам продумал легенду, заполнил cv, отвечал на все вопросы и по легенде и по теории, устроил 2 мок-интервью, поддерживал морально, почти держал меня за руку на моем 1 скрининге и торговался как черт за оффер.  В первые дни на работе подсказывал как правильно задать тот или иной вопрос.\nИтог: 2 недели на подготовку и 3 недели после открытия cv и оффер 280к, боюсь собесов намного меньше. Моя оценка 10/10\n\nАвтор: @Vladimir0feshenko\n",
    "@SmasH_Buster #SmasH_Buster\n\nГотовился к техническому собеседованию на стажировку в один из крупных банков (Java Backend) и решил обратиться к Никите с запросом помочь подготовиться к практической части собеседования, т.к. чувствовал себя неуверенно в лайвкодинге. Никита оперативно нашел время (в праздничный день 🙃), за что ему отдельное спасибо, т.к. до интервью оставалось мало времени. В итоге на созвоне я потренировался в режиме онлайн решать задачки (несколько задачек на массивы, задачка на SQL), а также мы разобрали интересный пример \"плохого\" кода. Никита грамотно направляет и подсказывает, если начинаешь тупить). В итоге созвон оказался мне очень полезным и помог пройти первый этап. Если не получится попасть на стажировку, то однозначно решил для себя, что возьму мок-собес у Никиты в качестве подготовки к другим собеседованиям. Рекомендую обращаться к Никите, он очень адекватный и приятный в общении человек).\n\nАвтор: @Stormblessed3D\n",
    "@SmasH_Buster #SmasH_Buster\n\nЦель была сменить работу на более высокий доход после года на первой работе на не самом актуальном джавовом стеке. Пришел к ментору с запросом помочь мне выучить кафку и микросервисы на основе какого-нибудь пет-проекта. \nНикита за 15 минут мне вправил мозги. Парой вопросов оценил мой общий уровень, назвал примерную цифру на которую нужно целиться и отправил на собесы. Не стал брать деньги за консультацию, предложив задонатить по результату. \nНа собесах честно называл стек, на котором работал. Отвечал, что да, кафку и микросервисы не знаю, но для того работу и меняю, чтобы получить опыт в актуальных технологиях. По итогу пять офферов от 230к до 280к. \nБыли небольшие сомнения, не сильно ли я выше головы прыгнул с такими офферами с своим, как мне казалось, недостаточным опытом. Опять обратился к Никите. И снова за 10 минут он меня успокоил и посоветовал лететь в бой) \nПо итогу я получил контроффер в текущей организации с переходом в другую команду и с выигрышем по деньгам, относительно других офферов. А Никита получил заслуженный донат за супер короткую и супер полезную консультацию, которой он сэкономил мне уйму времени и денег)\n\nАвтор: @bkjvdev\n",
    "@SmasH_Buster #SmasH_Buster Никита Перевалов.\n\nИзучал Java самостоятельно на протяжении около 8 месяцев с переменным успехом. По итогу зашел в тупик и не знал куда двигаться дальше. Чтобы не тратить время и силы на ненужные знания, решил обратиться к ментору из таблички. Написал Никите, мы провели первый созвон где детально обсудили планы и формат взаимодействия. Никита дал ссылки на ресурсы для подготовки и списки вопросов по модулям.\nПо итогу я сдал все модули с первого раза (заняло месяц) и мы начали подготавливать резюме, провели мок-интервью.\nЯ вышел на рынок в конце 2023 года, прошел около 12 интервью,первые 5 были провальные (что норма),а  потом пошло как по маслу. В итоге получил оффер на мидла 220к (реального опыта 0) и сейчас буду проходить испытательный срок.\nВзаимодействие с Никитой на этом не прекратилось, так как я могу обращаться к нему за помощью по рабочим таскам.\nСмело рекомендую работу с данным ментором!\n\nАвтор: @dotnet_runner\n",
    "@SmasH_Buster #SmasH_Buster Никита Перевалов.\n\nПришла к Никите перед стажировкой в стартаповой команде. Было очень тяжело и меня закинули на котлин, плюс стек новый кроме спринга и довольно требовательный лид. Никита помог вкатиться и выдержать начало, по описаниям проблемы тренировал на навыки и конструкции кода, чтобы не нарушить нда. Я выжила на стажировке, оставили в крупной компании без накруток опыта и вранья. Спасибо Никите за моральную поддержку частые созвоны, скилы и помощь в адаптации!\n\nАвтор: @korvalanni\n",
    "@SmasH_Buster #SmasH_Buster Никита Перевалов.\n\nНе понимал в какую сторону двигаться, какой текущий уровень знаний, и на какую зп могу претендовать. \nНикита провел мок собес, указал на узкие места, сориентировал по зарплатным ожиданиям, помог с легендой, а самое главное-дал уверенности для дальнейших действий)\n\nАвтор: @apereslavtsev\n",
    "@SmasH_Buster #SmasH_Buster Nikita Perevalov\n\nПроходил у @SmasH_Buster МОК собес за 5к рублей. Хотел оценить свои навыки перед выходом на рынок. Собес длился 2 часа, была как теоретическая часть, вопросы по резюме и опыту работы, так и решение задачи. В итоге Никита дал развернутую обратную связь, подсветил сильные и слабые стороны, ответил на все мои вопросы, дал конкретные ссылки и темы где прокачаться. Рекомендую.\n\nАвтор: @baterok\n",
    "@SmasH_Buster #SmasH_Buster\nНикита Перевалов\n\nВ конце сентября после провала самостоятельного поиска работы я решил обратиться за помощью к менторам из стаи. После знакомства с несколькими менторами я на уровне интуиции остановил свой выбор на @SmasH_Buster (и интуиция не подвела).\nМой запрос был относительно простой и банальный - подготовиться к техническим интервью, скорректировать мое резюме и сделать его релевантным для рекрутеров, проработать легенду о моих предыдущих местах работы.\nЗа полтора месяца мы провели ряд созвонов по подготовке к технической части интервью (по теории шли довольно активно и созвоны были каждые 2-3 дня), закрепили теорию двумя mock интервью, отшлифовали все шероховатости моего резюме, продумали легенду и в середине ноября я начал активно откликаться на вакансии. Отклики на мое резюме не заставили себя ждать и я начал ходить по собесам. После сложных для меня интервью мы с Никитой обсуждали и моделировали ситуации, в которых я возможно неправильно себя повел, делали выводы и я двигался к следующему собесу гораздо увереннее. Никита проявил максимальное участие, был всегда на связи (и до сих пор остается).\nКак итог - 3 собеса в день и еще куча отменных лично мной, 4 вкусных оффера и трудоустройство в конце ноября на условиях, которые оказались значительно выше моих ожиданий.\n\nАвтор: @gtyene\n",
    "@SmasH_Buster #SmasH_Buster Никита Перевалов\n\nС октября по ноябрь занимался с @SmasH_Buster по вопросам проработки резюме, атакже по способам пройти неадекватные фильтры эйчаров\nПровели 4 созвона и мок-собес, по результатам получил качественный и развернутый фидбек\nТакже Никита помог указать на пробелы в знаниях, которые я ликвидировал благодаря очень понятному объяснению со стороны Никиты.\nПо итогам наших занятий мне удалось получить оффер, а также заручиться помощью и поддержкой ментора, который сможет помочь мне в рабочих задачах, подсказать и разобрать непонятное\n\nАвтор: @urgmaker\n",
    "#SmasH_Buster @SmasH_Buster Никита Перевалов\n\nС конца августа по конец сентября занимался с Никитой.  Подтягивал знания в основном по теории, так как практические знания у меня имелись, для прохождения собесов. Стандартные Java вещи (Java Core, Collections, Concurrency, Spring, Hibernate, SQL, Алгоритмы, Паттерны). \nВ итоге спустя месяц хорошей подготовки - я сдал ему все топики, прошел мок-собес, мы отредактировали с ним резюме и я принялся искать работу. За месяц удалось выбить 5 офферов  (суммы все начинались от 230к на руки, а самый жирный оффер получился на 280к). По итогу устроился в МТС, так как испытал симпатию к проекту и компании в целом.\n\nНа протяжении всего обучения, я задавал Никите много вопросов, как практических, так и теоретических. На сессиях он мне очень подробно и наглядно объяснял, если я чего-то не понимал. В процессе поиска всегда помогал, спрашивал как прошло и мы разбирали ошибки, которые я допускал на собесах. \nПо итогу я очень доволен обучением, так как я осуществил поставленную цель - устроиться на новую работу с 2х зп. Ну, и помимо этого, мои контакты пополнились грамотным специалистом, к которому я и сейчас всегда могу обратиться с вопросами. \nОчень советую этого ментора!\n\n\nАвтор: @alextale1\n"
]